def printMax(x, y):
    '''Выводит максимальное из двух чисел.
Оба значения должны быть целыми числами.'''
    x = int(x) # конвертируем в целые, если возможно
    y = int(y)
    if x > y:
        print(x, 'наибольшее')
    else:
        print(y, 'наибольшее')

def printAvg(x, y):
    '''Выводит максимальное из двух чисел.
Оба значения должны быть целыми числами.'''
    x = int(x) # конвертируем в целые, если возможно
    y = int(y)
    print((x + y) // 2)

def printMin(x, y):
    '''Выводит максимальное из двух чисел.
Оба значения должны быть целыми числами.'''
    x = int(x) # конвертируем в целые, если возможно
    y = int(y)
    if x < y:
        print(x, 'наименьшее')
    else:
        print(y, 'наименьшее')
